### `Chaining Formulas is better than creating many intermediate dataframes`

In [1]:
import pandas as pd

In [2]:
# dictionary data

data = {
    'Year': [1980, 1990, 20001, 2015, 2023],
    'Time': [11.49, 08.61, 11.49, 09.64, 13.65],
    'Athlete': ['Shelly-Ann Fraser-Pryce', 'Elaine Thompson-Herah', 'Florence Griffith-Joyner', 'Carmelita Jeter', 'Marion Jones'],
    'Place': ['Jamaica', 'Jamaica', 'United States', 'United States', 'United States']
}

In [3]:
# Creating the dataframe using dictionary data

df = pd.DataFrame(data)

In [4]:
df

   Year   Time                   Athlete          Place
0  2091  11.49   Shelly-Ann Fraser-Pryce        Jamaica
1  2092   8.61     Elaine Thompson-Herah        Jamaica
2  2093  11.49  Florence Griffith-Joyner  United States
3  2094   9.64           Carmelita Jeter  United States
4  2095  13.65              Marion Jones  United States

In [6]:
df_out = (df.query('Year > 1950')
          .groupby(['Athlete'])[['Time']].min()
          .sort_values('Athlete')
         )

In [7]:
df_out

                           Time
Athlete
Carmelita Jeter            9.64
Elaine Thompson-Herah      8.61
Florence Griffith-Joyner  11.49
Marion Jones              13.65
Shelly-Ann Fraser-Pryce   11.49